; domain
(define (domain fo-counters-rnd)
    (:requirements :strips :typing :equality :adl :fluents)
    (:types counter)
  (:predicates
    (nop ?x - counter)
  )

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )
)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_5_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 - counter
	)
  (:init
		(= (value c0) 12)
	(= (value c1) 49)
	(= (value c2) 93)
	(= (value c3) 23)
	(= (value c4) 79)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
		)
	)
)

; plan
1. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 3 of 4
2. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 3 of 4
3. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 3 of 4
4. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 3 of 4
5. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 3 of 4
6. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 3 of 4
7. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 3 of 4
8. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 3 of 4
9. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 3 of 4
10. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 3 of 4
11. (increment c3)
   changed: (value c3) from 23 to 33
   goals met: 3 of 4
12. (increment c3)
   changed: (value c3) from 33 to 43
   goals met: 3 of 4
13. (increment c3)
   changed: (value c3) from 43 to 53
   goals met: 3 of 4
14. (increment c3)
   changed: (value c3) from 53 to 63
   goals met: 3 of 4
15. (increment c3)
   changed: (value c3) from 63 to 73
   goals met: 3 of 4
16. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 3 of 4
17. (increment c3)
   changed: (value c3) from 73 to 83
   goals met: 2 of 4
18. (increment c3)
   changed: (value c3) from 83 to 93
   goals met: 2 of 4
19. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 2 of 4
20. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 2 of 4
21. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 2 of 4
22. (increment c4)
   changed: (value c4) from 79 to 82
   goals met: 2 of 4
23. (decrement c2)
   changed: (value c2) from 93 to 92
   goals met: 3 of 4
24. (increment c4)
   changed: (value c4) from 82 to 85
   goals met: 3 of 4
25. (increment c4)
   changed: (value c4) from 85 to 88
   goals met: 3 of 4
26. (increment c4)
   changed: (value c4) from 88 to 91
   goals met: 3 of 4
27. (increment c4)
   changed: (value c4) from 91 to 94
   goals met: 4 of 4
